export const MUNIS_DISTRICTS = [
  "אזור יהודה והשומרון",
  "הדרום",
  "המרכז",
  "הצפון",
  "חיפה",
  "ירושלים",
  "תל אביב",
];
export const MUNIS_CLASSIFICATIONS = ["מועצה אזורית", "עירייה", "מועצה מקומית"];
export const MUNIS_SECTORS = [
  "כללי",
  "מעורב",
  "חרדי",
  "ערבי",
  "דרוזי",
  "בדואי דרום",
  "בדואי צפון",
  "צרקסי",
  "תעשייתי",
];
export const MUNIS_ROLES: string[] = [
  "ראש רשות",
  "עוזר/ת ראש רשות",
  'מנמ"ר/ית',
  'מנכ"ל/ית',
  'עוזר/ת מנכ"ל',
  'משנה למנכ"ל',
  'סמנכ"ל/ית',
  "גזבר/ית",
  "הנדסה",
  "מוביל/ה דיגיטלי/ת",
  "חירום וביטחון",
  "רווחה",
  "חינוך",
  "פיתוח כלכלי",
  "אגף תפעול",
  "משאבי אנוש",
  "דוברות",
  'שפ"ע',
  "רישוי עסקים",
  "מחשוב",
  "מנהל/ת שירות לתושב",
  "אחראי/ת GIS",
  "רכש ומכרזים",
  "תרבות וספורט",
];
export const MUNIS_CONTACTS_SOURCE_LISTS = [
  "קהילה מקצועית לומדת",
  "אלפון",
  "265",
  "מסלול הפיילוטים",
  "מאיצים דיגיטליים",
  "מובילים דיגיטליים",
  "טבלת אנשי קשר מרכזית יחידה",
  "קהילות let's gov",
  "וובינרים דיגיטלית",
  "שיחה עם האיש קשר",
  "שיחה עם הרשות המקומית",
];

export const MUNIS_MINI: { id: number; name: string }[] = [
  {
    id: 1,
    name: "אבו גוש",
  },
  {
    id: 2,
    name: "אבו סנאן",
  },
  {
    id: 3,
    name: "אבן יהודה",
  },
  {
    id: 4,
    name: "אום אל פחם",
  },
  {
    id: 5,
    name: "אופקים",
  },
  {
    id: 6,
    name: "אור יהודה",
  },
  {
    id: 7,
    name: "אור עקיבא",
  },
  {
    id: 8,
    name: "אורנית",
  },
  {
    id: 9,
    name: "אזור",
  },
  {
    id: 10,
    name: "אילת",
  },
  {
    id: 11,
    name: "אכסאל",
  },
  {
    id: 12,
    name: "אל בטוף",
  },
  {
    id: 13,
    name: "אל קסום",
  },
  {
    id: 14,
    name: "אלונה",
  },
  {
    id: 15,
    name: "אליכין",
  },
  {
    id: 16,
    name: "אלעד",
  },
  {
    id: 17,
    name: "אלפי מנשה",
  },
  {
    id: 18,
    name: "אלקנה",
  },
  {
    id: 19,
    name: "אעבלין",
  },
  {
    id: 20,
    name: "אפרת",
  },
  {
    id: 21,
    name: "אריאל",
  },
  {
    id: 22,
    name: "אשדוד",
  },
  {
    id: 23,
    name: "אשכול",
  },
  {
    id: 24,
    name: "אשקלון",
  },
  {
    id: 25,
    name: "באקה אל גרביה",
  },
  {
    id: 26,
    name: "באר טוביה",
  },
  {
    id: 27,
    name: "באר יעקב",
  },
  {
    id: 28,
    name: "באר שבע",
  },
  {
    id: 29,
    name: "בוסתן אל מרג",
  },
  {
    id: 30,
    name: "בועיינה נוגידאת",
  },
  {
    id: 31,
    name: "בוקעאתא",
  },
  {
    id: 32,
    name: "ביר אל מכסור",
  },
  {
    id: 33,
    name: "בית אל",
  },
  {
    id: 34,
    name: "בית אריה עופרים",
  },
  {
    id: 35,
    name: "בית גן",
  },
  {
    id: 36,
    name: "בית דגן",
  },
  {
    id: 37,
    name: "בית שאן",
  },
  {
    id: 38,
    name: "בית שמש",
  },
  {
    id: 39,
    name: "ביתר עילית",
  },
  {
    id: 40,
    name: "בני ברק",
  },
  {
    id: 41,
    name: "בני עיש",
  },
  {
    id: 42,
    name: "בני שמעון",
  },
  {
    id: 43,
    name: "בנימינה גבעת עדה",
  },
  {
    id: 44,
    name: "בסמה",
  },
  {
    id: 45,
    name: "בסמת טבעון",
  },
  {
    id: 46,
    name: "בענה",
  },
  {
    id: 47,
    name: "ברנר",
  },
  {
    id: 48,
    name: "בת ים",
  },
  {
    id: 49,
    name: "גבעת זאב",
  },
  {
    id: 50,
    name: "גבעת שמואל",
  },
  {
    id: 51,
    name: "גבעתיים",
  },
  {
    id: 52,
    name: "גדיידה מכר",
  },
  {
    id: 53,
    name: "גדרה",
  },
  {
    id: 54,
    name: "גדרות",
  },
  {
    id: 55,
    name: "גולן",
  },
  {
    id: 56,
    name: "גולס",
  },
  {
    id: 57,
    name: "גוש עציון",
  },
  {
    id: 58,
    name: "גזר",
  },
  {
    id: 59,
    name: "גלגוליה",
  },
  {
    id: 60,
    name: "גן יבנה",
  },
  {
    id: 61,
    name: "גן רווה",
  },
  {
    id: 62,
    name: "גני תקווה",
  },
  {
    id: 63,
    name: "גסר א זרקא",
  },
  {
    id: 64,
    name: "גש גוש חלב",
  },
  {
    id: 65,
    name: "גת",
  },
  {
    id: 66,
    name: "דאלית אל כרמל",
  },
  {
    id: 67,
    name: "דבורייה",
  },
  {
    id: 68,
    name: "דייר אל אסד",
  },
  {
    id: 69,
    name: "דייר חנא",
  },
  {
    id: 70,
    name: "דימונה",
  },
  {
    id: 71,
    name: "דרום השרון",
  },
  {
    id: 72,
    name: "הגלבוע",
  },
  {
    id: 73,
    name: "הגליל העליון",
  },
  {
    id: 74,
    name: "הגליל התחתון",
  },
  {
    id: 75,
    name: "הוד השרון",
  },
  {
    id: 76,
    name: "הערבה התיכונה",
  },
  {
    id: 77,
    name: "הר אדר",
  },
  {
    id: 78,
    name: "הר חברון",
  },
  {
    id: 79,
    name: "הרצליה",
  },
  {
    id: 80,
    name: "זבולון",
  },
  {
    id: 81,
    name: "זכרון יעקב",
  },
  {
    id: 82,
    name: "זמר",
  },
  {
    id: 83,
    name: "זרזיר",
  },
  {
    id: 84,
    name: "חבל אילות",
  },
  {
    id: 85,
    name: "חבל יבנה",
  },
  {
    id: 86,
    name: "חבל מודיעין",
  },
  {
    id: 87,
    name: "חדרה",
  },
  {
    id: 88,
    name: "חולון",
  },
  {
    id: 89,
    name: "חוף אשקלון",
  },
  {
    id: 90,
    name: "חוף הכרמל",
  },
  {
    id: 91,
    name: "חוף השרון",
  },
  {
    id: 92,
    name: "חורה",
  },
  {
    id: 93,
    name: "חורפיש",
  },
  {
    id: 94,
    name: "חיפה",
  },
  {
    id: 95,
    name: "חצור הגלילית",
  },
  {
    id: 96,
    name: "חריש",
  },
  {
    id: 97,
    name: "טבריה",
  },
  {
    id: 98,
    name: "טובא זנגרייה",
  },
  {
    id: 99,
    name: "טורעאן",
  },
  {
    id: 100,
    name: "טייבה",
  },
  {
    id: 101,
    name: "טירה",
  },
  {
    id: 102,
    name: "טירת כרמל",
  },
  {
    id: 103,
    name: "טמרה",
  },
  {
    id: 104,
    name: "יאנוח גת",
  },
  {
    id: 105,
    name: "יבנאל",
  },
  {
    id: 106,
    name: "יבנה",
  },
  {
    id: 107,
    name: "יהוד מונוסון",
  },
  {
    id: 108,
    name: "יואב",
  },
  {
    id: 109,
    name: "יסוד המעלה",
  },
  {
    id: 110,
    name: "יפיע",
  },
  {
    id: 111,
    name: "יקנעם עילית",
  },
  {
    id: 112,
    name: "ירוחם",
  },
  {
    id: 113,
    name: "ירושלים",
  },
  {
    id: 114,
    name: "ירכא",
  },
  {
    id: 115,
    name: "כאבול",
  },
  {
    id: 116,
    name: "כאוכב אבו אל היגא",
  },
  {
    id: 117,
    name: "כוכב יאיר",
  },
  {
    id: 118,
    name: "כסיפה",
  },
  {
    id: 119,
    name: "כסרא סמיע",
  },
  {
    id: 120,
    name: "כעביה טבאש חגאגרה",
  },
  {
    id: 121,
    name: "כפר ברא",
  },
  {
    id: 122,
    name: "כפר ורדים",
  },
  {
    id: 123,
    name: "כפר יאסיף",
  },
  {
    id: 124,
    name: "כפר יונה",
  },
  {
    id: 125,
    name: "כפר כמא",
  },
  {
    id: 126,
    name: "כפר כנא",
  },
  {
    id: 127,
    name: "כפר מנדא",
  },
  {
    id: 128,
    name: "כפר סבא",
  },
  {
    id: 129,
    name: "כפר קאסם",
  },
  {
    id: 130,
    name: "כפר קרע",
  },
  {
    id: 131,
    name: "כפר שמריהו",
  },
  {
    id: 132,
    name: "כפר תבור",
  },
  {
    id: 133,
    name: "כרמיאל",
  },
  {
    id: 134,
    name: "לב השרון",
  },
  {
    id: 135,
    name: "להבים",
  },
  {
    id: 136,
    name: "לוד",
  },
  {
    id: 137,
    name: "לכיש",
  },
  {
    id: 138,
    name: "לקיה",
  },
  {
    id: 139,
    name: "מבואות החרמון",
  },
  {
    id: 140,
    name: "מבשרת ציון",
  },
  {
    id: 141,
    name: "מגאר",
  },
  {
    id: 142,
    name: "מגד אל כרום",
  },
  {
    id: 143,
    name: "מגדל",
  },
  {
    id: 144,
    name: "מגדל העמק",
  },
  {
    id: 145,
    name: "מגדל שמס",
  },
  {
    id: 146,
    name: "מגידו",
  },
  {
    id: 147,
    name: "מגילות ים המלח",
  },
  {
    id: 148,
    name: "מודיעין מכבים רעות",
  },
  {
    id: 149,
    name: "מודיעין עילית",
  },
  {
    id: 150,
    name: "מזכרת בתיה",
  },
  {
    id: 151,
    name: "מזרעה",
  },
  {
    id: 152,
    name: "מטה אשר",
  },
  {
    id: 153,
    name: "מטה בנימין",
  },
  {
    id: 154,
    name: "מטה יהודה",
  },
  {
    id: 155,
    name: "מטולה",
  },
  {
    id: 156,
    name: "מיתר",
  },
  {
    id: 157,
    name: "מנשה",
  },
  {
    id: 158,
    name: "מסעדה",
  },
  {
    id: 159,
    name: "מעיליא",
  },
  {
    id: 160,
    name: "מעלה אדומים",
  },
  {
    id: 161,
    name: "מעלה אפרים",
  },
  {
    id: 162,
    name: "מעלה יוסף",
  },
  {
    id: 163,
    name: "מעלה עירון",
  },
  {
    id: 164,
    name: "מעלות תרשיחא",
  },
  {
    id: 165,
    name: "מצפה רמון",
  },
  {
    id: 166,
    name: "מרום הגליל",
  },
  {
    id: 167,
    name: "מרחבים",
  },
  {
    id: 168,
    name: "משגב",
  },
  {
    id: 169,
    name: "משהד",
  },
  {
    id: 170,
    name: "נהריה",
  },
  {
    id: 171,
    name: "נווה מדבר",
  },
  {
    id: 172,
    name: "נוף הגליל",
  },
  {
    id: 173,
    name: "נחל שורק",
  },
  {
    id: 174,
    name: "נחף",
  },
  {
    id: 175,
    name: "נס ציונה",
  },
  {
    id: 176,
    name: "נצרת",
  },
  {
    id: 177,
    name: "נשר",
  },
  {
    id: 178,
    name: "נתיבות",
  },
  {
    id: 179,
    name: "נתניה",
  },
  {
    id: 180,
    name: "סאגור",
  },
  {
    id: 181,
    name: "סביון",
  },
  {
    id: 182,
    name: "סחנין",
  },
  {
    id: 183,
    name: "עגר",
  },
  {
    id: 184,
    name: "עומר",
  },
  {
    id: 185,
    name: "עיילבון",
  },
  {
    id: 186,
    name: "עילוט",
  },
  {
    id: 187,
    name: "עין מאהל",
  },
  {
    id: 188,
    name: "עין קנייא",
  },
  {
    id: 189,
    name: "עכו",
  },
  {
    id: 190,
    name: "עמנואל",
  },
  {
    id: 191,
    name: "עמק הירדן",
  },
  {
    id: 192,
    name: "עמק המעיינות",
  },
  {
    id: 193,
    name: "עמק חפר",
  },
  {
    id: 194,
    name: "עמק יזרעאל",
  },
  {
    id: 195,
    name: "עספיא",
  },
  {
    id: 196,
    name: "עפולה",
  },
  {
    id: 197,
    name: "עראבה",
  },
  {
    id: 198,
    name: "ערבות הירדן",
  },
  {
    id: 199,
    name: "ערד",
  },
  {
    id: 200,
    name: "ערערה",
  },
  {
    id: 201,
    name: "ערערה בנגב",
  },
  {
    id: 202,
    name: "פוריידיס",
  },
  {
    id: 203,
    name: "פסוטה",
  },
  {
    id: 204,
    name: "פקיעין בוקייעה",
  },
  {
    id: 205,
    name: "פרדס חנה כרכור",
  },
  {
    id: 206,
    name: "פרדסייה",
  },
  {
    id: 207,
    name: "פתח תקווה",
  },
  {
    id: 208,
    name: "צפת",
  },
  {
    id: 209,
    name: "קדומים",
  },
  {
    id: 210,
    name: "קדימה צורן",
  },
  {
    id: 211,
    name: "קלנסווה",
  },
  {
    id: 212,
    name: "קצרין",
  },
  {
    id: 213,
    name: "קריית אונו",
  },
  {
    id: 214,
    name: "קריית ארבע",
  },
  {
    id: 215,
    name: "קריית אתא",
  },
  {
    id: 216,
    name: "קריית ביאליק",
  },
  {
    id: 217,
    name: "קריית גת",
  },
  {
    id: 218,
    name: "קריית טבעון",
  },
  {
    id: 219,
    name: "קריית ים",
  },
  {
    id: 220,
    name: "קריית יערים",
  },
  {
    id: 221,
    name: "קריית מוצקין",
  },
  {
    id: 222,
    name: "קריית מלאכי",
  },
  {
    id: 223,
    name: "קריית עקרון",
  },
  {
    id: 224,
    name: "קריית שמונה",
  },
  {
    id: 225,
    name: "קרני שומרון",
  },
  {
    id: 226,
    name: "ראמה",
  },
  {
    id: 227,
    name: "ראש העין",
  },
  {
    id: 228,
    name: "ראש פינה",
  },
  {
    id: 229,
    name: "ראשון לציון",
  },
  {
    id: 230,
    name: "רהט",
  },
  {
    id: 231,
    name: "רחובות",
  },
  {
    id: 232,
    name: "ריינה",
  },
  {
    id: 233,
    name: "רכסים",
  },
  {
    id: 234,
    name: "רמלה",
  },
  {
    id: 235,
    name: "רמת גן",
  },
  {
    id: 236,
    name: "רמת השרון",
  },
  {
    id: 237,
    name: "רמת ישי",
  },
  {
    id: 238,
    name: "רמת נגב",
  },
  {
    id: 239,
    name: "רעננה",
  },
  {
    id: 240,
    name: "שבלי אום אל גנם",
  },
  {
    id: 241,
    name: "שגב שלום",
  },
  {
    id: 242,
    name: "שדות דן",
  },
  {
    id: 243,
    name: "שדות נגב",
  },
  {
    id: 244,
    name: "שדרות",
  },
  {
    id: 245,
    name: "שוהם",
  },
  {
    id: 246,
    name: "שומרון",
  },
  {
    id: 247,
    name: "שלומי",
  },
  {
    id: 248,
    name: "שעב",
  },
  {
    id: 249,
    name: "שער הנגב",
  },
  {
    id: 250,
    name: "שער שומרון",
  },
  {
    id: 251,
    name: "שפיר",
  },
  {
    id: 252,
    name: "שפרעם",
  },
  {
    id: 253,
    name: "תל אביב יפו",
  },
  {
    id: 254,
    name: "תל מונד",
  },
  {
    id: 255,
    name: "תל שבע",
  },
  {
    id: 256,
    name: "תמר",
  },
  {
    id: 257,
    name: "תפן",
  },
  {
    id: 258,
    name: "נאות חובב",
  },
  {
    id: 259,
    name: "צור הדסה",
  },
];

export const CLUSTERS = [
  "בית הכרם",
  "גליל ועמקים",
  "גליל מזרחי",
  "גליל מערבי",
  "יהודה ושומרון",
  "כנרת ועמקים",
  "המפרץ",
  "נגב מזרחי",
  "נגב מערבי",
  "השרון",
  "שורק דרומי",
  "מישור החוף",
  "ללא",
];

export const POPULATION_SOURCES = [
  "הלשכה המרכזית לסטטיסטיקה",
  "רשות האוכלוסין",
];
